#+title: RNA-seq Leg Vs Body workflow
#+STARTUP: overview
#+STARTUP: hideblocks
#+STARTUP: noinlineimages
#+SETUPFILE: https://fniessen.github.io/org-html-themes/org/theme-readtheorg.setup
#+EXPORT_FILE_NAME: index.html

****** Build WGCNA data file from quant file
WGCNA doesn't understand tximport datasets, so we must manipulate the quant files into a dataset that WGCNA can understand.
#+begin_src python :tangle scripts/analysis/import_functions.py
import pandas as pd
from itertools import combinations
def convert_to_WGCNA(meta_name):
    # quant files
    meta = pd.read_csv(f"data/metadata/{meta_name}.csv")
    data = pd.DataFrame()
    for i in meta.name:
        data[i] = pd.read_table(f"data/quant/{meta_name}/{i}")["TPM"]
    truth = pd.DataFrame()

    truth["sample"] = meta["name"]
    # truth table
    for col in meta.columns[1::]:
        comparisons = meta[col].unique()
        for comparison in comparisons:
            truth[col +"_"+ str(comparison)] = meta[col].apply(lambda x: int(x == col))
    extracomparisions = combinations(truth.columns[1::], 2)
    for comparison in extracomparisions:
        truth[comparison[0] + "__" + comparison[1]] = truth[[comparison[0], comparison[1]]].apply(lambda x: x[comparison[0]] or x[comparison[1]], axis=1)

    return truth
return convert_to_WGCNA("main")
#+end_src

#+RESULTS:
#+begin_example
sample  pesticides_perm  ...  trial_1__trial_2  trial_3__trial_2
0     Per_Bod_1.tabular                0  ...                 0                 0
1     Per_Bod_3.tabular                0  ...                 0                 0
2     Per_Leg_3.tabular                0  ...                 0                 0
3     Per_Leg_2.tabular                0  ...                 0                 0
4     Per_Leg_1.tabular                0  ...                 0                 0
5    Deet_Bod_3.tabular                0  ...                 0                 0
6    Deet_Bod_2.tabular                0  ...                 0                 0
7    Deet_Bod_1.tabular                0  ...                 0                 0
8    Deet_Leg_3.tabular                0  ...                 0                 0
9    Deet_Leg_2.tabular                0  ...                 0                 0
10   Deet_Leg_1.tabular                0  ...                 0                 0
11   Cont_Bod_3.tabular                0  ...                 0                 0
12   Cont_Bod_2.tabular                0  ...                 0                 0
13   Cont_Bod_1.tabular                0  ...                 0                 0
14   Cont_Leg_3.tabular                0  ...                 0                 0
15  Cont_Leg_2a.tabular                0  ...                 0                 0
16   Cont_Leg_1.tabular                0  ...                 0                 0

[17 rows x 37 columns]
#+end_example

*** Venn Diagram: Deet expression in body genes
#+begin_src R :session figures :tangle scripts/figures/figures.r :async
body <- csv_data_up$body_leg$rows
deet <- csv_data_up$deet$rows
plot <- list("body" = body, "deet" = deet)
pl <- ggVennDiagram(plot, color="black", edge_size = 0) + scale_fill_distiller(palette = "Blues" )
ggsave("./output/figures/figure_5/body_plot.svg", pl)
ggsave("./output/figures/figure_5/body_plot.png", pl)

#+end_src

#+RESULTS:
: ./output/figures/figure_5/body_plot.png

*** Venn Diagram: Deet Expression in Leg genes
Most deet regulated genes are not regulated in the leg
#+begin_src R :session figures :tangle scripts/figures/figures.r :async
leg <- csv_data_down$body_leg$rows
deet <- csv_data_up$deet$rows
plot <- list("leg" = both, "deet" = deet)
pl <- ggVennDiagram(plot, color="black", edge_size = 0) + scale_fill_distiller(palette = "Blues" )
ggsave("./output/figures/figure_5/leg_plot.svg", pl)
ggsave("./output/figures/figure_5/leg_plot.png", pl)

#+end_src

#+RESULTS:
: ./output/figures/figure_5/leg_plot.png

** Figure 9: Time Course Legs
This is a kmeans plot of genes deferentially expressed in the tick leg compared to the time course data (time_series)
#+begin_src R :session figures :tangle scripts/figures/figures.r :async
time_series <- vsd$time_series
time_series_body_leg <- list(
  "leg" = subset(time_series, time_series$rows %in% csv_data_down$body_leg$rows),
  "body" = subset(time_series, time_series$rows %in% csv_data_up$body_leg$rows)
)
d <- kplot_var_data(time_series_body_leg)
d$leg <- d$leg[!(d$leg$pesticides == "control"), ]
order <- c("deet-0.25h", "deet-4h", "deet-24h", "perm-2h", "perm-6h", "perm-24h")
pl <- ggplot(d$leg, aes(x = factor(condition, levels = order), y = value)) +
  geom_jitter(aes(color = condition)) +
  ggh4x::facet_grid2(cluster ~ factor(pesticides, levels = c("deet", "perm")), scales = "free", independent = "y") +
  geom_boxplot(alpha = 0) +
  stat_summary(aes(y = value, group = 1), fun = median, colour = "black", geom = "line", group = 1) +
  ggtitle("Variance Stabilized Kmean Clusters for Genes Expressed in Tick Legs")
ggsave("./output/figures/figure_9/plot.svg", pl)
ggsave("./output/figures/figure_9/plot.png", pl)
#+end_src

#+RESULTS:
: ./output/figures/figure_9/plot.png

** Figure 10: Time Course Body
This is a kmeans plot of genes deferentially expressed in the tick body compared to the time course data (time_series)
#+begin_src R :session figures :tangle scripts/figures/figures.r :async
d$body <- d$body[!(d$body$pesticides == "control"),]
order <- c("deet-0.25h", "deet-4h", "deet-24h", "perm-2h", "perm-6h", "perm-24h")
pl <- ggplot(d$body, aes(x = factor(condition, levels=order), y = value)) +
  geom_jitter(aes(color = condition), size = 0.5) +
  ggh4x::facet_grid2(cluster ~ factor(pesticides, levels=c("deet", "perm")), scales="free", independent="y") +
  geom_boxplot(alpha = 0) +
  stat_summary(aes(y = value, group = 1), fun = median, colour = "black", geom = "line", group = 1) +
  ggtitle("Variance Stabilized Kmean Clusters for Genes Expressed in Tick Legs")
ggsave("./output/figures/figure_10/plot.svg", pl, height=12, width=7)
ggsave("./output/figures/figure_10/plot.png", pl, height=12, width=7)
#+end_src

#+RESULTS:
: ./output/figures/figure_10/plot.png
